app/Http/Controllers/MainController.php

    public function index()
    {
        $data = [];

        //$data['service_tags'] = Tag::byServices()->get();
        $data['service_tags'] = ServiceHomeTag::with(['service','section.tags'])->where('visible', 1)->orderBy('order')->get();
---
select * from `service_home_tags` where `visible` = '1' order by `order` asc
select * from `services` where `services`.`id` in ('1', '2', '3')

    public function projects($tags = null) {
        $tag_names = (! is_null($tags) ? explode('/', $tags) : null);

        \View::share('page_title', 'Проекты');

        $tag_groups = TagGroup::
            whereHas('tags', function($query) {
                return $query->whereHas('projects', function ($query) {
                    return $query->where('projects.visible', 1);
                });
            })
            ->orderBy('tag_groups.order')
            ->get()
---
select * from `tag_groups` where exists (select * from `tags` inner join `tag_tag_group` on `tags`.`id` = `tag_tag_group`.`tag_id` where `tag_groups`.`id` = `tag_tag_group`.`tag_group_id` and exists (select * from `projects` inner join `project_tag` on `projects`.`id` = `project_tag`.`project_id` where `tags`.`id` = `project_tag`.`tag_id` and `projects`.`visible` = '1')) order by `tag_groups`.`order` asc



        $filter_tags = Tag::
            whereHas('projects', function($query) {
                return $query->where('projects.visible', 1);
            })
            ->whereHas('groups', function($query) use(&$tag_names) {
                if($tag_names) {
                    $query->whereIn('tag_groups.name', $tag_names);
                }
                return $query;
            })
            ->orderBy('tags.order')
            ->get()
---
select * from `tags` where exists (select * from `projects` inner join `project_tag` on `projects`.`id` = `project_tag`.`project_id` where `tags`.`id` = `project_tag`.`tag_id` and `projects`.`visible` = '1') and exists (select * from `tag_groups` inner join `tag_tag_group` on `tag_groups`.`id` = `tag_tag_group`.`tag_group_id` where `tags`.`id` = `tag_tag_group`.`tag_id` and `tag_groups`.`name` in ('naming', 'strategy', 'style', 'pkg')) order by `tags`.`order` asc

        }

        $next_project_id = Project::
        select('id')
            ->where('id', '!=', $project->id)
            ->where('visible', 1)
            ->where('projects.order', '>', $project->order)
            ->orderBy('projects.order')
            ->first()
---
select `id` from `projects` where `id` != '1' and `visible` = '1' and `projects`.`order` > '0' order by `projects`.`order` asc limit 1